
&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьСервер(КоличествоДокументов, СдвигПоМесяцам);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСервер(ДокументовДобавить, СдвигПоМесяцам)
	
	Генератор = Новый ГенераторСлучайныхЧисел;
	
	ДокументовДобавить = ДокументовДобавить + 1;
	
	Для Сч = 1 По ДокументовДобавить Цикл
		
		НайденныйДок = Документы.ТестовыйДокумент.НайтиПоНомеру(Формат(Сч, "ЧЦ=11; ЧВН=; ЧГ=0"));
		
		Если НайденныйДок.Пустая() Тогда
			НовДок = Документы.ТестовыйДокумент.СоздатьДокумент();
			НовДок.Дата = ДобавитьМесяц(ТекущаяДата(), СдвигПоМесяцам);
			НовДок.Комментарий = "Это документ №" + (Сч) + " от " + НовДок.Дата;
			НовДок.Рейтинг = Генератор.СлучайноеЧисло(1, 5000);
			НовДок.Сумма = Генератор.СлучайноеЧисло(1, 15000);
			НовДок.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
